{
  "About": "About",
  "Skills": "Skills",
  "Projects": "Projects",
  "Contact": "Contact",
  "Hello!": "Hello!",
  "I&apos;m": "I'm",
  "hero1word": "I build cool stuff for the web with modern technologies.",
  "hero2word": "Let's create something awesome together!",
  "MyToolbox": "My Toolbox",
  "myskillshere": "Here are some of the technologies and tools I work with",
  "frontend": "Frontend",
  "backend": "Backend",
  "otherskills": "Other Skills",
  "recentProjects": "Recent Projects",
  "movieApp": "Movie App",
  "Food Delivery": "Food Delivery",
  "viducate": "Viducate",
  "Buy Me Coffee": "Buy Me Coffee",
  "Monorepo": "Monorepo",
  "Todo-list": "Todo-list",
  "weather": "Weather",
  "Your name": "Your name",
  "Your email": "Your email",
  "Name": "Name",
  "Email": "Email",
  "Message": "Message",
  "Send Message": "Send Gmail",
  "Send a Message": "Send a Message",
  "Sending...": "Sending...",
  "Message sent successfully!": "Message sent successfully!",
  "Thanks for reaching out. I'll get back to you soon.": "Thanks for reaching out. I'll get back to you soon.",
  "me1": "I'm a dedicated full-stack developer who enjoys building both visually appealing and practical web applications. I have a good grasp of frontend and backend technologies, and I take pleasure in turning my ideas into reality by writing clean code and prioritizing user experience.",
  "me2": "When I'm not coding, you can find me exploring new technologies, playing video games, or sipping a nice cup of coffee. I believe in continuous learning and pushing the boundaries of what’s possible on the web. It's exciting to see how technology evolves, and I’m always eager to stay updated on the latest trends and tools that can enhance my work.",
  "About Me": "About Me",
  "Battulga": "Battulga",
  "Im": "I'm",
  "gdg": "",
  "FullstackDev": "Fullstack Dev",
  "I&apos;ll get back to you as soon as possible!": "I'll get back to you as soon as possible!",
  "Get In Touch": "Get In Touch",
  "Have a project in mind or just want to say hi? Drop me a message!": "If you are planning a project, get in touch. Let's create something amazing together.",
  "viducateDescription": "A project using Youtube transcript and Google Cloud Translation API, and by doing the hardest part myself, I was able to speed up my team's process by 30%. Responsible for front-end development and created an easy-to-use UI.",
  "foodDeliveryDescription": "The development focused on the ordering system and the ease of use of the admin area.By starting this project, I understood 100% the operation on Cloudinary and MongoDb.",
  "buymecoffeeDescription": "A modern web application designed to mimic a creator support platform where users can send small donations (or “coffees”) to their favorite creators. The goal of the project was to practice full-stack development, integrating real-world features such as payment processing and user interaction.",
  "movieAppDescription": "Movie App is a sleek, dynamic web application built with React, designed to enhance frontend development skills by integrating live APIs. This project API Integration – Fetching real-time movie data from TMDB/OMDb, State Management – Efficiently handling data with React hooks (useState, useEffect, etc.),User-Friendly UI – A clean, responsive interface for browsing, searching, and viewing detailed movie information.Perfect for practicing modern React workflows and API consumption!",
  "todoDescription": "A responsive, full-stack To-Do List app built using JavaScript. Users can add tasks and filter them by status All, Active, or Completed.",
  "monorepoDescription": "As part of the Pinecone Monorepo project, I learned how to write fully automated tests using Cypress and Jest. I created pull requests on GitHub, conducted code reviews, and studied and applied the build compile and test pipeline in a CI/CD environment.I understood the features of the Monorepo architecture, organized multiple apps in a single repo, and collaborated effectively with team members through version control and branch workflow. I regularly ran automated tests and performed early bug detection to improve code quality and team productivity.",
  "weatherDescription": "An app that displays real-time weather information based on the user's location. It uses the OpenWeather API to display temperature, weather conditions, and location names. It uses the Geolocation API to detect the user's location, and is a lightweight and fast app built on React.",
  "Messenger": "Messenger",
  "Instagram": "Instagram",
  "Hello! I'd like to talk about...": "Hello! I'd like to talk about...",
  "Built with heart , powered by soul": "Built with heart , powered by soul",
  "Call": "Call",
  "Github": "Github"
}
