{
  "About": "Миний тухай",
  "Skills": "Чадварууд",
  "Projects": "Төслүүд",
  "Contact": "Холбоо барих",
  "Hello!": "Сайн уу!",
  "I&apos;m": "Би",
  "hero1word": "Би орчин үеийн технологиор вэбд зориулсан гайхалтай зүйлсийг бүтээдэг.",
  "hero2word": "Хамтдаа гайхалтай зүйлийг бүтээцгээе!",
  "MyToolbox": "Миний багажны хайрцаг",
  "myskillshere": "Миний  ашигладаг  зарим технологи , хэрэгслүүд  ",
  "frontend": "Пронтэнд",
  "backend": "Байкэнд",
  "otherskills": "Бусад чадварууд",
  "recentProjects": "Саяхны төслүүд",
  "movieApp": "Кино Апп",
  "Food Delivery": "Хоол Хүргэлт",
  "viducate": "Видукейт",
  "Buy Me Coffee": "Хандивийн вэбсайт",
  "Monorepo": "Монорепо",
  "Todo-list": "Хийх зүйлсийн жагсаалт",
  "weather": "Цаг агаарын апп",
  "Your name": "Таны нэр",
  "Your email": "Таны имэйл",
  "Name": "Нэр",
  "Email": "Имэйл",
  "Message": "Мессеж",
  "Send Message": "Майл Илгээх",
  "Send a Message": "Мессеж Илгээх",
  "Sending...": "Илгээж байна...",
  "Message sent successfully!": "Мессеж амжилттай илгээгдлээ!",
  "Thanks for reaching out. I'll get back to you soon.": "Мессеж илгээсэнд баярлалаа. Би тантай удахгүй эргэж холбогдоно.",
  "me1": "Би нүдэнд харагдахуйц, практик вэб програмуудыг бүтээх дуртай, бүрэн стек хөгжүүлэгч юм. Би frontend болон backend технологийг сайн эзэмшсэн бөгөөд цэвэр код бичиж, хэрэглэгчийн туршлагыг чухалчлан санаагаа бодит болгоход таатай байна.",
  "me2": "Би код бичээгүй үедээ шинэ технологи судлах, видео тоглоом тоглох эсвэл аятайхан кофе ууж амрах дуртай. Би насан туршдаа тууштай суралцана гэдэгтээ итгэдэг бөгөөд технологи хэрхэн өөрчлөгдөж байгааг харахдаа үргэлж баяртай байдаг. Миний төслүүдийг сайжруулах хамгийн сүүлийн үеийн чиг хандлага, хэрэгслүүдийг дагаж мөрдөхийг хүсдэг.",
  "About Me": "Миний тухай",
  "Battulga": "Баттулга",
  "Im": "Намайг",
  "gdg": "гэдэг",
  "FullstackDev": "Fullstack Dev",
  "I&apos;ll get back to you as soon as possible!": "Би тантай аль болох хурдан эргэж холбогдох болно",
  "Get In Touch": "Холбоо барих",
  "Have a project in mind or just want to say hi? Drop me a message!": "Та төсөл төлөвлөж байгаа бол холбогдоорой. Хамтдаа гайхалтай зүйлийг бүтээцгээе",
  "viducateDescription": "Youtube transcript болон Google Cloud Translation API ашиглаж хийсэн төсөл ба хамгийн хүнд хэсгийг бие даан гүйцэтгэснээр багийнхаа үйл явцыг 30% - иар хурдасгаж чадсан. Front-end талын хөгжүүлэлтийг хариуцаж ашиглахад  хялбар  UI-г бүтээсэн.",
  "foodDeliveryDescription": "Захиалгийн систем болон админ хэсгийн хялбар ажиллагаа зэрэг дээр анхааран хөгжүүлэлт хийсэн.Энэ төслийг эхлүүлснээр би Cloudinary , MongoDb дээрх   үйл  ажиллагааг 100% ойлгож авсан юм.",
  "buymecoffeeDescription": "Хэрэглэгчид дуртай бүтээгчиддээ бага хэмжээний хандив (эсвэл “кофе”) илгээх боломжтой бүтээгчийг дэмжих платформыг дуурайлган бүтээсэн орчин үеийн вэб програм. Төслийн зорилго нь бүрэн стек хөгжүүлэлтийг дадлагажуулах, төлбөрийн зохицуулалт, хэрэглэгчийн харилцан үйлчлэл гэх мэт бодит функцуудыг нэгтгэх явдал юм.",
  "movieAppDescription": "Movie App нь React-аар хийгдсэн, киноны мэдээллийг TMDB/OMDb зэрэг API-аас шууд авах боломжтой вэб апп. Энэ төсөл нь API интеграц – Киноны өгөгдлийг бодит цагт авах State Management – React hooks (useState, useEffect) ашиглан төлөв удирдах Хэрэглэгчид ээлтэй UI – Хайлт, дэлгэрэнгүй мэдээлэл үзэх боломжтой.React болон API ашиглах дадлагад төгс төсөл!",
  "todoDescription": "Javascript ашиглан бүтээсэн хариуцлагатай, Full‑stack To‑Do List апп. Хэрэглэгчид даалгавраа нэмэх, All, Active, Completed статусаар нь шүүх боломжтой.",
  "monorepoDescription": "Багаар хамтран ажилласан Pinecone Monorepo төслийн хүрээнд би Cypress болон Jest ашиглан бүрэн автоматжуулсан тест бичих чадвар эзэмшсэн. GitHub дээр pull request үүсгэж, кодын review хийх, CI/CD орчинд build compile болон test pipeline хэрхэн явагддагийг судалж, практикт хэрэглэж сурсан. Monorepo архитектурын онцлогийг ойлгож, олон апп‑уудыг нэг репод цэгцтэй зохион байгуулж, багийн гишүүдтэй version control, branch workflow‑оор үр дүнтэй хамтарч ажилласан. Кодын чанар, багийн productivity‑г дээшлүүлэх зорилгоор автомат тестүүдийг тогтмол ажиллуулж, алдаа илрүүлэлтийг эрт шатанд гүйцэтгэж байсан.",
  "weatherDescription": "Хэрэглэгчийн байршлаас хамаарч реал-тайм цаг агаарын мэдээлэл харуулдаг апп. OpenWeather API ашиглан температур, цаг агаарын нөхцөл, байршлын нэр зэргийг ашигласан. Geolocation API ашиглан хэрэглэгчийн байршлыг илрүүлдэг бөгөөд React дээр бүтээгдсэн хөнгөн, шуурхай ажиллагаатай апп юм.",
  "Messenger": "Мессенжер",
  "Instagram": "Инстаграм",
  "Hello! I'd like to talk about...": "Сайн уу! Би энэ тухай яримаар байна...",
  "Built with heart , powered by soul": "Зүрхээр бүтээгдэж, сүнсээр ажилладаг",
  "Call": "Залгах",
  "Github": "Гитхаб"
}
